tyskink/STM32_Project/Cortex_A/IMX6_test/RTE/Device/MCIMX6X3_Cortex-M4/startup_iMX6SX_M4.s
__Vectors_Size 	EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler                       [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                CPSID   I               ; Mask interrupts
                LDR     R0, =SystemInit
                BLX     R0
                CPSIE   i               ; Unmask interrupts
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler                         [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler                   [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler                   [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler                    [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler                  [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler                         [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler                    [WEAK]
                B       .
                ENDP
PendSV_Handler  PROC
                EXPORT  PendSV_Handler                      [WEAK]
                B       .
                ENDP
SysTick_Handler PROC
                EXPORT  SysTick_Handler                     [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  CORTEX_M4_IRQHandler                [WEAK]
                EXPORT  DAP_IRQHandler                      [WEAK]
                EXPORT  SDMA_IRQHandler                     [WEAK]
                EXPORT  SNVS_PMIC_IRQHandler                [WEAK]
                EXPORT  LCDIF1_IRQHandler                   [WEAK]
                EXPORT  LCDIF2_IRQHandler                   [WEAK]
                EXPORT  CSI1_IRQHandler                     [WEAK]
                EXPORT  PXP_IRQHandler                      [WEAK]
                EXPORT  GPU_IRQHandler                      [WEAK]
                EXPORT  WDOG3_IRQHandler                    [WEAK]
                EXPORT  SEMA4_CP1_IRQHandler                [WEAK]
                EXPORT  APBH_IRQHandler                     [WEAK]
                EXPORT  EIM_IRQHandler                      [WEAK]
                EXPORT  BCH_IRQHandler                      [WEAK]
                EXPORT  GPMI_IRQHandler                     [WEAK]
                EXPORT  UART6_IRQHandler                    [WEAK]
                EXPORT  eCSPI5_IRQHandler                   [WEAK]
                EXPORT  SNVS_Consolidated_IRQHandler        [WEAK]
                EXPORT  SNVS_Security_IRQHandler            [WEAK]
                EXPORT  CSU_IRQHandler                      [WEAK]
                EXPORT  uSDHC1_IRQHandler                   [WEAK]
                EXPORT  uSDHC2_IRQHandler                   [WEAK]
                EXPORT  uSDHC3_IRQHandler                   [WEAK]
                EXPORT  uSDHC4_IRQHandler                   [WEAK]
                EXPORT  UART1_IRQHandler                    [WEAK]
                EXPORT  UART2_IRQHandler                    [WEAK]
                EXPORT  UART3_IRQHandler                    [WEAK]
                EXPORT  UART4_IRQHandler                    [WEAK]
                EXPORT  UART5_IRQHandler                    [WEAK]
                EXPORT  eCSPI1_IRQHandler                   [WEAK]
                EXPORT  eCSPI2_IRQHandler                   [WEAK]
                EXPORT  eCSPI3_IRQHandler                   [WEAK]
                EXPORT  eCSPI4_IRQHandler                   [WEAK]
                EXPORT  I2C4_IRQHandler                     [WEAK]
                EXPORT  I2C1_IRQHandler                     [WEAK]
                EXPORT  I2C2_IRQHandler                     [WEAK]
                EXPORT  I2C3_IRQHandler                     [WEAK]
                EXPORT  RDC_IRQHandler                      [WEAK]
                EXPORT  USB_HISC_IRQHandler                 [WEAK]
                EXPORT  CSI2_IRQHandler                     [WEAK]
                EXPORT  USB_OTG2_IRQHandler                 [WEAK]
                EXPORT  USB_OTG1_IRQHandler                 [WEAK]
                EXPORT  USB_PHY_UTMI0_IRQHandler            [WEAK]
                EXPORT  USB_PHY_UTMI1_IRQHandler            [WEAK]
                EXPORT  SSI1_IRQHandler                     [WEAK]
                EXPORT  SSI2_IRQHandler                     [WEAK]
                EXPORT  SSI3_IRQHandler                     [WEAK]
                EXPORT  TEMPMON_IRQHandler                  [WEAK]
                EXPORT  ASRC_IRQHandler                     [WEAK]
                EXPORT  ESAI_IRQHandler                     [WEAK]
                EXPORT  SPDIF_IRQHandler                    [WEAK]
                EXPORT  MLB_Error_IRQHandler                [WEAK]
                EXPORT  PMU_BrownOut_IRQHandler             [WEAK]
                EXPORT  GPT_IRQHandler                      [WEAK]
                EXPORT  EPIT1_IRQHandler                    [WEAK]
                EXPORT  EPIT2_IRQHandler                    [WEAK]
                EXPORT  GPIO1_INT7_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT6_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT5_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT4_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT3_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT2_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT1_IRQHandler               [WEAK]
                EXPORT  GPIO1_INT0_IRQHandler               [WEAK]
                EXPORT  GPIO1_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO1_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO2_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO2_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO3_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO3_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO4_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO4_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO5_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO5_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO6_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO6_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  GPIO7_Combined_0_15_IRQHandler      [WEAK]
                EXPORT  GPIO7_Combined_16_31_IRQHandler     [WEAK]
                EXPORT  WDOG1_IRQHandler                    [WEAK]
                EXPORT  WDOG2_IRQHandler                    [WEAK]
                EXPORT  KPP_IRQHandler                      [WEAK]
                EXPORT  PWM1_PWM5_IRQHandler                [WEAK]
                EXPORT  PWM2_PWM6_IRQHandler                [WEAK]
                EXPORT  PWM3_PWM7_IRQHandler                [WEAK]
                EXPORT  PWM4_PWM8_IRQHandler                [WEAK]
                EXPORT  CCM1_IRQHandler                     [WEAK]
                EXPORT  CCM2_IRQHandler                     [WEAK]
                EXPORT  GPC_IRQHandler                      [WEAK]
                EXPORT  MU_A9_IRQHandler                    [WEAK]
                EXPORT  SRC_IRQHandler                      [WEAK]
                EXPORT  CPU_L2_IRQHandler                   [WEAK]
                EXPORT  CPU_Parity_IRQHandler               [WEAK]
                EXPORT  CPU_Perfomance_IRQHandler           [WEAK]
                EXPORT  CPU_CTI_Trigger_IRQHandler          [WEAK]
                EXPORT  SRC_WDOG_IRQHandler                 [WEAK]
                EXPORT  SAI1_IRQHandler                     [WEAK]
                EXPORT  SAI2_IRQHandler                     [WEAK]
                EXPORT  MU_M4_IRQHandler                    [WEAK]
                EXPORT  ADC1_IRQHandler                     [WEAK]
                EXPORT  ADC2_IRQHandler                     [WEAK]
                EXPORT  ENET2_IRQHandler                    [WEAK]
                EXPORT  ENET2_Timer_IRQHandler              [WEAK]
                EXPORT  SJC_IRQHandler                      [WEAK]
                EXPORT  CAAM0_IRQHandler                    [WEAK]
                EXPORT  CAAM1_IRQHandler                    [WEAK]
                EXPORT  QSPI1_IRQHandler                    [WEAK]
                EXPORT  TZASC_IRQHandler                    [WEAK]
                EXPORT  QSPI2_IRQHandler                    [WEAK]
                EXPORT  FLEXCAN1_IRQHandler                 [WEAK]
                EXPORT  FLEXCAN2_IRQHandler                 [WEAK]
                EXPORT  SEMA4_CP0_IRQHandler                [WEAK]
                EXPORT  MLB_Channels_31_0_IRQHandler        [WEAK]
                EXPORT  ENET1_IRQHandler                    [WEAK]
                EXPORT  ENET1_Timer_IRQHandler              [WEAK]
                EXPORT  PCIe1_IRQHandler                    [WEAK]
                EXPORT  PCIe2_IRQHandler                    [WEAK]
                EXPORT  PCIe3_IRQHandler                    [WEAK]
                EXPORT  PCIe4_IRQHandler                    [WEAK]
                EXPORT  DCIC1_IRQHandler                    [WEAK]
                EXPORT  DCIC2_IRQHandler                    [WEAK]
                EXPORT  MLB_Channels_63_32_IRQHandler       [WEAK]
                EXPORT  PMU_BrownOutCore_IRQHandler         [WEAK]

WDT_IRQHandler
CORTEX_M4_IRQHandler
DAP_IRQHandler
SDMA_IRQHandler
SNVS_PMIC_IRQHandler
LCDIF1_IRQHandler
LCDIF2_IRQHandler
CSI1_IRQHandler
PXP_IRQHandler
GPU_IRQHandler
WDOG3_IRQHandler
SEMA4_CP1_IRQHandler
APBH_IRQHandler
EIM_IRQHandler
BCH_IRQHandler
GPMI_IRQHandler
UART6_IRQHandler
eCSPI5_IRQHandler
SNVS_Consolidated_IRQHandler
SNVS_Security_IRQHandler
CSU_IRQHandler
uSDHC1_IRQHandler
uSDHC2_IRQHandler
uSDHC3_IRQHandler
uSDHC4_IRQHandler
UART1_IRQHandler
UART2_IRQHandler
UART3_IRQHandler
UART4_IRQHandler
UART5_IRQHandler
eCSPI1_IRQHandler
eCSPI2_IRQHandler
eCSPI3_IRQHandler
eCSPI4_IRQHandler
I2C4_IRQHandler
I2C1_IRQHandler
I2C2_IRQHandler
I2C3_IRQHandler
RDC_IRQHandler
USB_HISC_IRQHandler
CSI2_IRQHandler
USB_OTG2_IRQHandler
USB_OTG1_IRQHandler
USB_PHY_UTMI0_IRQHandler
USB_PHY_UTMI1_IRQHandler
SSI1_IRQHandler
SSI2_IRQHandler
SSI3_IRQHandler
TEMPMON_IRQHandler
ASRC_IRQHandler
ESAI_IRQHandler
SPDIF_IRQHandler
MLB_Error_IRQHandler
PMU_BrownOut_IRQHandler
GPT_IRQHandler
EPIT1_IRQHandler
EPIT2_IRQHandler
GPIO1_INT7_IRQHandler
GPIO1_INT6_IRQHandler
GPIO1_INT5_IRQHandler
GPIO1_INT4_IRQHandler
GPIO1_INT3_IRQHandler
GPIO1_INT2_IRQHandler
GPIO1_INT1_IRQHandler
GPIO1_INT0_IRQHandler
GPIO1_Combined_0_15_IRQHandler
GPIO1_Combined_16_31_IRQHandler
GPIO2_Combined_0_15_IRQHandler
GPIO2_Combined_16_31_IRQHandler
GPIO3_Combined_0_15_IRQHandler
GPIO3_Combined_16_31_IRQHandler
GPIO4_Combined_0_15_IRQHandler
GPIO4_Combined_16_31_IRQHandler
GPIO5_Combined_0_15_IRQHandler
GPIO5_Combined_16_31_IRQHandler
GPIO6_Combined_0_15_IRQHandler
GPIO6_Combined_16_31_IRQHandler
GPIO7_Combined_0_15_IRQHandler
GPIO7_Combined_16_31_IRQHandler
WDOG1_IRQHandler
WDOG2_IRQHandler
KPP_IRQHandler
PWM1_PWM5_IRQHandler
PWM2_PWM6_IRQHandler
PWM3_PWM7_IRQHandler
PWM4_PWM8_IRQHandler
CCM1_IRQHandler
CCM2_IRQHandler
GPC_IRQHandler
MU_A9_IRQHandler
SRC_IRQHandler
CPU_L2_IRQHandler
CPU_Parity_IRQHandler
CPU_Perfomance_IRQHandler
CPU_CTI_Trigger_IRQHandler
SRC_WDOG_IRQHandler
SAI1_IRQHandler
SAI2_IRQHandler
MU_M4_IRQHandler
ADC1_IRQHandler
ADC2_IRQHandler
ENET2_IRQHandler
ENET2_Timer_IRQHandler
SJC_IRQHandler
CAAM0_IRQHandler
CAAM1_IRQHandler
QSPI1_IRQHandler
TZASC_IRQHandler
QSPI2_IRQHandler
FLEXCAN1_IRQHandler
FLEXCAN2_IRQHandler
SEMA4_CP0_IRQHandler
MLB_Channels_31_0_IRQHandler
ENET1_IRQHandler
ENET1_Timer_IRQHandler
PCIe1_IRQHandler
PCIe2_IRQHandler
PCIe3_IRQHandler
PCIe4_IRQHandler
DCIC1_IRQHandler
DCIC2_IRQHandler
MLB_Channels_63_32_IRQHandler
PMU_BrownOutCore_IRQHandler
                B       .
                ENDP

                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
